#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ssm_parameter.ssh_key: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_ssm_parameter.ssh_key: Read complete after 1s [id=/development/ssh_key]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-03b371d239dfe4af4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.nginx_jenkins_conf will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "nginx_jenkins_conf" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            # upstream jenkins {
            #     server ${k3s_control_plane_private_ip}:8080;
            # }
            
            server {
                listen 8080;
                # server_name jenkins.elysium-space.com;
            
                location / {
                    proxy_pass http://${k3s_control_plane_private_ip}:8080;
                    proxy_set_header Host jenkins.elysium-space.com;
                    proxy_set_header X-Real-IP $remote_addr;
                    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
                    proxy_set_header X-Forwarded-Proto $scheme;
                }
            }
        EOT
      + vars     = {
          + "k3s_control_plane_private_ip" = (known after apply)
        }
    }

  # data.template_file.nginx_k3s_conf will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "nginx_k3s_conf" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            stream {
                upstream api {
                    server ${k3s_control_plane_private_ip}:6443;
                }
                server {
                    listen 6443; # this is the port exposed by nginx on reverse proxy server
                    proxy_pass api;
                    proxy_timeout 20s;
                }
            }
        EOT
      + vars     = {
          + "k3s_control_plane_private_ip" = (known after apply)
        }
    }

  # aws_cloudwatch_log_group.vpc_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vpc/flow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Name" = "rs-vpc-flow-log-group-dev"
        }
      + tags_all          = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-vpc-flow-log-group-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "rs-nat-eip-dev"
        }
      + tags_all             = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-nat-eip-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc                  = (known after apply)
    }

  # aws_flow_log.vpc_flow will be created
  + resource "aws_flow_log" "vpc_flow" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name" = "rs-vpc-flow-logs-dev"
        }
      + tags_all                 = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-vpc-flow-logs-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_instance_profile.bastion_profile will be created
  + resource "aws_iam_instance_profile" "bastion_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "rs-bastion-instance-profile-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "rs-bastion-role-dev"
      + tags_all    = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.controlplane_profile will be created
  + resource "aws_iam_instance_profile" "controlplane_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "rs-controlplane-instance-profile-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "rs-controlplane-role-dev"
      + tags_all    = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.worker_profile will be created
  + resource "aws_iam_instance_profile" "worker_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "rs-worker-instance-profile-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "rs-worker-role-dev"
      + tags_all    = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.bastion_policy will be created
  + resource "aws_iam_policy" "bastion_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow Bastion EC2 instance to read SSH key from SSM"
      + id               = (known after apply)
      + name             = "rs-bastion-policy-dev"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:eu-north-1:767398122881:parameter/development/ssh_key",
                          + "arn:aws:ssm:eu-north-1:767398122881:parameter/conf/nginx_k3s_conf",
                          + "arn:aws:ssm:eu-north-1:767398122881:parameter/conf/nginx_jenkins_conf",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ssm:UpdateInstanceInformation",
                          + "ssmmessages:*",
                          + "ec2messages:*",
                          + "cloudwatch:PutMetricData",
                          + "ds:CreateComputer",
                          + "ds:DescribeDirectories",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
    }

  # aws_iam_policy.controlplane_policy will be created
  + resource "aws_iam_policy" "controlplane_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow EC2 to read kubeconfig from SSM"
      + id               = (known after apply)
      + name             = "rs-controlplane-policy-dev"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:PutParameter"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:eu-north-1:767398122881:parameter/development/kubeconfig",
                          + "arn:aws:ssm:eu-north-1:767398122881:parameter/development/node-token",
                        ]
                    },
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-north-1:767398122881:parameter/development/ssh_key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
    }

  # aws_iam_policy.worker_policy will be created
  + resource "aws_iam_policy" "worker_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow EC2 to read kubeconfig from SSM"
      + id               = (known after apply)
      + name             = "rs-worker-policy-dev"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:eu-north-1:767398122881:parameter/development/kubeconfig",
                          + "arn:aws:ssm:eu-north-1:767398122881:parameter/development/node-token",
                          + "arn:aws:ssm:eu-north-1:767398122881:parameter/development/ssh_key",
                        ]
                    },
                  + {
                      + Action   = "ec2:DescribeInstances"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
    }

  # aws_iam_role.bastion_role will be created
  + resource "aws_iam_role" "bastion_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rs-bastion-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.controlplane_role will be created
  + resource "aws_iam_role" "controlplane_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rs-controlplane-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.vpc_flow_logs_role will be created
  + resource "aws_iam_role" "vpc_flow_logs_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rs-vpc-flow-logs-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "rs-vpc-flow-logs-role-dev"
        }
      + tags_all              = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-vpc-flow-logs-role-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.worker_role will be created
  + resource "aws_iam_role" "worker_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rs-worker-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.bastion_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "bastion_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rs-bastion-role-dev"
    }

  # aws_iam_role_policy_attachment.controlplane_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "controlplane_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rs-controlplane-role-dev"
    }

  # aws_iam_role_policy_attachment.vpc_flow_logs_policy will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flow_logs_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
      + role       = "rs-vpc-flow-logs-role-dev"
    }

  # aws_iam_role_policy_attachment.worker_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "worker_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rs-worker-role-dev"
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-03b371d239dfe4af4"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "rs-bastion-instance-profile-dev"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "blackbird"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "rs-bastion-dev"
          + "Role" = "bastion"
        }
      + tags_all                             = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-bastion-dev"
          + "Role"      = "bastion"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "71910090c79cf535332e4e9205c2855a60c7b660"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = true
          + enable_resource_name_dns_aaaa_record = false
          + hostname_type                        = "resource-name"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = "gp3"
        }
    }

  # aws_instance.k3s_control_plane will be created
  + resource "aws_instance" "k3s_control_plane" {
      + ami                                  = "ami-03b371d239dfe4af4"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "rs-controlplane-instance-profile-dev"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "blackbird"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "K8s_Role" = "control-plane"
          + "Name"     = "rs-k3s-control-plane-dev"
        }
      + tags_all                             = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "K8s_Role"  = "control-plane"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-k3s-control-plane-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "b9e8864a25ddb7e7550361fefddc87eea93a37e9"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = true
          + enable_resource_name_dns_aaaa_record = false
          + hostname_type                        = "resource-name"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = "gp3"
        }
    }

  # aws_instance.k3s_worker will be created
  + resource "aws_instance" "k3s_worker" {
      + ami                                  = "ami-03b371d239dfe4af4"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "rs-worker-instance-profile-dev"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "blackbird"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "K8s_Role" = "worker"
          + "Name"     = "rs-k3s-worker-dev"
        }
      + tags_all                             = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "K8s_Role"  = "worker"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-k3s-worker-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "05179f0e91abc4b3ceac9c03effc34c618a2461a"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + network_interface (known after apply)

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = true
          + enable_resource_name_dns_aaaa_record = false
          + hostname_type                        = "resource-name"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id   = (known after apply)
    }

  # aws_kms_key.cloudwatch will be created
  + resource "aws_kms_key" "cloudwatch" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for encrypting VPC flow logs"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Name" = "rs-kms-key-cloudwatch-dev"
        }
      + tags_all                           = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-kms-key-cloudwatch-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
    }

  # aws_nat_gateway.natgw will be created
  + resource "aws_nat_gateway" "natgw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "rs-nat-gateway-dev"
        }
      + tags_all                           = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-nat-gateway-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
    }

  # aws_network_acl.private will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "rs-private-nacl-dev"
        }
      + tags_all   = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-private-nacl-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl.public will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "rs-public-nacl-dev"
        }
      + tags_all   = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-public-nacl-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl_rule.private_inbound_all_vpc will be created
  + resource "aws_network_acl_rule" "private_inbound_all_vpc" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # aws_network_acl_rule.private_inbound_ephemeral will be created
  + resource "aws_network_acl_rule" "private_inbound_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 65535
    }

  # aws_network_acl_rule.private_inbound_icmp_vpc will be created
  + resource "aws_network_acl_rule" "private_inbound_icmp_vpc" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = -1
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "icmp"
      + rule_action    = "allow"
      + rule_number    = 120
      + to_port        = -1
    }

  # aws_network_acl_rule.private_outbound_all will be created
  + resource "aws_network_acl_rule" "private_outbound_all" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
    }

  # aws_network_acl_rule.public_inbound_all will be created
  + resource "aws_network_acl_rule" "public_inbound_all" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # aws_network_acl_rule.public_outbound_all will be created
  + resource "aws_network_acl_rule" "public_outbound_all" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "rs-private-route-table-dev"
        }
      + tags_all         = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-private-route-table-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "rs-public-route-table-dev"
        }
      + tags_all         = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-public-route-table-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.bastion_sg will be created
  + resource "aws_security_group" "bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for Bastion host SSH access"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow Jenkins from trusted CIDR"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow SSH from trusted CIDR"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow kubernetes API from trusted CIDR"
              + from_port        = 6443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6443
            },
        ]
      + name                   = "rs-sg-bastion-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rs-sg-bastion-dev"
        }
      + tags_all               = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-sg-bastion-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.vm_private_sg will be created
  + resource "aws_security_group" "vm_private_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for private VM instances"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow all VPC CIDR traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "rs-sg-private-vm-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rs-sg-private-vm-dev"
        }
      + tags_all               = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-sg-private-vm-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.vm_public_sg will be created
  + resource "aws_security_group" "vm_public_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for public VM instances"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all inbound traffic from the internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow all from VPC CIDR"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "rs-sg-public-vm-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rs-sg-public-vm-dev"
        }
      + tags_all               = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-sg-public-vm-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ssm_association.apply_nginx_conf_association will be created
  + resource "aws_ssm_association" "apply_nginx_conf_association" {
      + apply_only_at_cron_interval = false
      + arn                         = (known after apply)
      + association_id              = (known after apply)
      + document_version            = (known after apply)
      + id                          = (known after apply)
      + name                        = "apply_nginx_conf_ssm"
      + parameters                  = (known after apply)
      + tags_all                    = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }

      + targets {
          + key    = "InstanceIds"
          + values = (known after apply)
        }
    }

  # aws_ssm_document.apply_nginx_conf will be created
  + resource "aws_ssm_document" "apply_nginx_conf" {
      + arn              = (known after apply)
      + content          = jsonencode(
            {
              + description   = "Apply nginx reverse proxy k3s config, copy extra files, restart service, and run post-restart command"
              + mainSteps     = [
                  + {
                      + action = "aws:runShellScript"
                      + inputs = {
                          + runCommand = [
                              + "echo 'Fetching /conf/nginx_k3s_conf...'",
                              + "aws ssm get-parameter --name '/conf/nginx_k3s_conf' --query 'Parameter.Value' --output text > /etc/nginx/modules-enabled/k3s.conf",
                              + "if [ $? -ne 0 ]; then echo 'Failed to fetch /conf/nginx_k3s_conf'; exit 1; fi",
                              + "echo 'Fetching /conf/nginx_jenkins_conf...'",
                              + "aws ssm get-parameter --name '/conf/nginx_jenkins_conf' --query 'Parameter.Value' --output text > /etc/nginx/conf.d/jenkins.conf",
                              + "if [ $? -ne 0 ]; then echo 'Failed to fetch /conf/nginx_jenkins_conf'; exit 1; fi",
                              + "echo 'Restarting nginx...'",
                              + "sudo systemctl restart nginx && sudo systemctl enable nginx",
                              + "if [ $? -ne 0 ]; then echo 'Failed to restart nginx'; exit 1; fi",
                            ]
                        }
                      + name   = "applyConfigAndCopyFiles"
                    },
                ]
              + schemaVersion = "2.2"
            }
        )
      + created_date     = (known after apply)
      + default_version  = (known after apply)
      + description      = (known after apply)
      + document_format  = "JSON"
      + document_type    = "Command"
      + document_version = (known after apply)
      + hash             = (known after apply)
      + hash_type        = (known after apply)
      + id               = (known after apply)
      + latest_version   = (known after apply)
      + name             = "apply_nginx_conf_ssm"
      + owner            = (known after apply)
      + parameter        = (known after apply)
      + platform_types   = (known after apply)
      + schema_version   = (known after apply)
      + status           = (known after apply)
      + tags_all         = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
    }

  # aws_ssm_parameter.nginx_jenkins_conf will be created
  + resource "aws_ssm_parameter" "nginx_jenkins_conf" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/conf/nginx_jenkins_conf"
      + tags_all       = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.nginx_k3s_conf will be created
  + resource "aws_ssm_parameter" "nginx_k3s_conf" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/conf/nginx_k3s_conf"
      + tags_all       = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "rs-private-dev-1"
        }
      + tags_all                                       = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-private-dev-1"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "rs-private-dev-2"
        }
      + tags_all                                       = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-private-dev-2"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "rs-public-dev-1"
        }
      + tags_all                                       = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-public-dev-1"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "rs-public-dev-2"
        }
      + tags_all                                       = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-public-dev-2"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "rs-vpc-dev"
        }
      + tags_all                             = {
          + "CI"        = "GitHub Actions"
          + "Course"    = "RSSchool DevOps Course"
          + "Date"      = "2025-07-05"
          + "ManagedBy" = "Terraform"
          + "Name"      = "rs-vpc-dev"
          + "Task"      = "4. Jenkins Installation and Configuration"
        }
    }

  # local_file.ssh_key will be created
  + resource "local_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./blackbird.pem"
      + id                   = (known after apply)
    }

  # null_resource.provision_bastion will be created
  + resource "null_resource" "provision_bastion" {
      + id = (known after apply)
    }

  # null_resource.provision_k3s_control_plane will be created
  + resource "null_resource" "provision_k3s_control_plane" {
      + id = (known after apply)
    }

  # null_resource.provision_k3s_worker will be created
  + resource "null_resource" "provision_k3s_worker" {
      + id = (known after apply)
    }

  # null_resource.wait_for_health_check_bastion will be created
  + resource "null_resource" "wait_for_health_check_bastion" {
      + id = (known after apply)
    }

  # null_resource.wait_for_health_check_k3s_control_plane will be created
  + resource "null_resource" "wait_for_health_check_k3s_control_plane" {
      + id = (known after apply)
    }

  # null_resource.wait_for_health_check_k3s_worker will be created
  + resource "null_resource" "wait_for_health_check_k3s_worker" {
      + id = (known after apply)
    }

Plan: 56 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_public_ip            = (known after apply)
  + bastion_sg_id                = (known after apply)
  + k3s_control_plane_private_ip = (known after apply)
  + k3s_worker_private_ip        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "output.tfplan"

```

</details>

*Pusher: @isbelevtsov, Action: `pull_request`, Working Directory: `task_4/project/terraform`, Workflow: `Infrastructure Deployment`*